{
    "rule1": [
    "Review the memorandum and determine if it describes a plan or arrangement that could be considered an ERISA plan under Rule 1.",
    "Specifically, answer the following sub-questions:",
    "1a. Does the memorandum describe a formal or informal arrangement established or maintained by an employer or employee organization?",
    "1b. Does the arrangement provide benefits to participants or their beneficiaries?",
    "1c. Is there an intention for this arrangement to be ongoing (i.e. not just a one-time payment or ad-hoc benefit)?",
    "For each sub-question, provide:",
    "- A Yes/No answer.",
    "- A brief explanation referencing text from the memorandum where possible.",
    "Examples of what qualifies as a plan:",
    "- A company’s group health insurance program for employees.",
    "- A 401(k) retirement plan or defined benefit pension plan.",
    "- A formal severance pay plan with ongoing eligibility criteria and procedures.",
    "Examples of what does NOT qualify as a plan:",
    "- A one-time bonus or single lump-sum payment.",
    "- A purely discretionary payment made by the employer on a case-by-case basis.",
    "- A general statement of policy without a structured arrangement.",
    "Response should only have the following JSON format:",
    "{{",
    "  \"Rule\": \"Rule1\",",
    "  \"Rule Definition\": \"An arrangement established or maintained by an employer or employee organization to provide benefits to participants or their beneficiaries, which is ongoing and not a one-time payment or ad-hoc benefit.\",",
    "  \"Overall Eligible\": \"Yes\" or \"No\",",
    "  \"Citation\": \"Brief reference from the memorandum that supports the conclusion.\",",
    "  \"SubQuestions\": {{",
    "    \"{{1a}}\": {{",
    "      \"Question\": \"Does the memorandum describe a formal or informal arrangement established or maintained by an employer or employee organization?\",",
    "      \"Answer\": \"Yes\" or \"No\",",
    "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
    "    }},",
    "    \"{{1b}}\": {{",
    "      \"Question\": \"Does the arrangement provide benefits to participants or their beneficiaries?\",",
    "      \"Answer\": \"Yes\" or \"No\",",
    "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
    "    }},",
    "    \"{{1c}}\": {{",
    "      \"Question\": \"Is there an intention for this arrangement to be ongoing (i.e. not just a one-time payment or ad-hoc benefit)?\",",
    "      \"Answer\": \"Yes\" or \"No\",",
    "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
    "    }}",
    "  }}",
    "}}",
    "{sp_text}"
    ],

"rule2": [
  "Review the memorandum and determine if the arrangement described is established or maintained by an eligible sponsor under Rule 2.",
  "Specifically, answer the following sub-questions:",
  "2a. Is the arrangement established or maintained by an employer engaged in commerce or any industry affecting commerce?",
  "2b. Is the arrangement established or maintained by an employee organization representing employees engaged in commerce or any industry affecting commerce?",
  "2c. If neither of the above apply, is there any other eligible sponsor involved?",
  "For each sub-question, provide:",
  "- A Yes/No answer.",
  "- A brief explanation referencing text from the memorandum where possible.",
  "Examples of an eligible sponsor:",
  "- An employer in the private sector offering benefits to employees.",
  "- A union establishing a health or pension plan for its members.",
  "Examples of what does NOT qualify:",
  "- A governmental body (unless it's a private entity involved in commerce).",
  "- A plan solely for non-resident aliens working outside the US.",
  "Response should only have the following JSON format:",
  "{{",
  "  \"Rule\": \"Rule2\",",
  "  \"Rule Definition\": \"An arrangement established or maintained by an eligible sponsor (e.g., an employer engaged in commerce or a labor union) that provides benefits to participants or their beneficiaries.\",",
  "  \"Overall Eligible\": \"Yes\" or \"No\",",
  "  \"Citation\": \"Brief reference from the memorandum that supports the conclusion.\",",
  "  \"SubQuestions\": {{",
  "    \"{{2a}}\": {{",
  "      \"Question\": \"Is the arrangement established or maintained by an employer engaged in commerce or any industry affecting commerce?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{2b}}\": {{",
  "      \"Question\": \"Is the arrangement established or maintained by an employee organization representing employees engaged in commerce or any industry affecting commerce?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{2c}}\": {{",
  "      \"Question\": \"If neither of the above apply, is there any other eligible sponsor involved?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }}",
  "  }}",
  "}}",
  "{sp_text}"
],
"rule3": [
  "Review the memorandum and determine if the arrangement described provides eligible benefits under Rule 3.",
  "Specifically, answer the following sub-questions:",
  "3a. Does the arrangement provide pension benefits, such as retirement income or deferred income (e.g., 401(k) or defined benefit pension plan)?",
  "3b. Does the arrangement provide welfare benefits, such as health insurance, medical, dental, vision, life insurance, disability, apprenticeships, day care, scholarship funds, or other benefits listed in ERISA Section 3(1)?",
  "3c. Is the arrangement designed to provide any other benefit to participants or beneficiaries that could be considered an ERISA benefit?",
  "For each sub-question, provide:",
  "- A Yes/No answer.",
  "- A brief explanation referencing text from the memorandum where possible.",
  "Examples of eligible benefits:",
  "- Retirement or pension plan.",
  "- Group health insurance, dental, or vision benefits.",
  "- Disability insurance or life insurance.",
  "Examples of what does NOT qualify:",
  "- Payroll practices like direct payment of wages or vacation pay from general employer assets.",
  "- Workers’ compensation or unemployment insurance mandated by state law.",
  "Response should only have the following JSON format:",
  "{{",
  "  \"Rule\": \"Rule3\",",
  "  \"Rule Definition\": \"An arrangement that provides eligible benefits such as pension or welfare benefits to participants or their beneficiaries, as defined under ERISA.\",",
  "  \"Overall Eligible\": \"Yes\" or \"No\",",
  "  \"Citation\": \"Brief reference from the memorandum that supports the conclusion.\",",
  "  \"SubQuestions\": {{",
  "    \"{{3a}}\": {{",
  "      \"Question\": \"Does the arrangement provide pension benefits, such as retirement income or deferred income (e.g., 401(k) or defined benefit pension plan)?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{3b}}\": {{",
  "      \"Question\": \"Does the arrangement provide welfare benefits, such as health insurance, medical, dental, vision, life insurance, disability, apprenticeships, day care, scholarship funds, or other benefits listed in ERISA Section 3(1)?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{3c}}\": {{",
  "      \"Question\": \"Is the arrangement designed to provide any other benefit to participants or beneficiaries that could be considered an ERISA benefit?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }}",
  "  }}",
  "}}",
  "{sp_text}"
],
"rule4": [
  "Review the memorandum and determine if the arrangement described falls under any of the specific exemptions listed in Rule 4.",
  "Specifically, answer the following sub-questions:",
  "4a. Is the arrangement a governmental plan established and maintained by a state, municipality, or other governmental body?",
  "4b. Is the arrangement a church plan established and maintained by a church or religious organization (unless the church has elected ERISA coverage)?",
  "4c. Is the arrangement maintained solely to comply with workers’ compensation, unemployment, or disability insurance laws?",
  "4d. Is the arrangement maintained outside the United States primarily for the benefit of nonresident aliens?",
  "4e. Is the arrangement a payroll practice, such as direct payments of wages, overtime, vacation pay, or sick leave from the employer’s general assets?",
  "For each sub-question, provide:",
  "- A Yes/No answer.",
  "- A brief explanation referencing text from the memorandum where possible.",
  "Examples of plans that are exempt from ERISA:",
  "- A state-run retirement plan for public employees.",
  "- A religious organization’s pension plan that has not opted into ERISA.",
  "- Payments made under a state-mandated workers’ compensation program.",
  "Examples of what does NOT qualify for exemption:",
  "- A private employer’s group health insurance plan.",
  "- A private employer’s pension plan.",
  "Response should only have the following JSON format:",
  "{{",
  "  \"Rule\": \"Rule4\",",
  "  \"Rule Definition\": \"An arrangement that falls under one of the ERISA exemptions, such as governmental plans, church plans, workers’ compensation, nonresident aliens, or payroll practices.\",",
  "  \"Overall Eligible\": \"Yes\" or \"No\",",
  "  \"Citation\": \"Brief reference from the memorandum that supports the conclusion.\",",
  "  \"SubQuestions\": {{",
  "    \"{{4a}}\": {{",
  "      \"Question\": \"Is the arrangement a governmental plan established and maintained by a state, municipality, or other governmental body?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{4b}}\": {{",
  "      \"Question\": \"Is the arrangement a church plan established and maintained by a church or religious organization (unless the church has elected ERISA coverage)?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{4c}}\": {{",
  "      \"Question\": \"Is the arrangement maintained solely to comply with workers’ compensation, unemployment, or disability insurance laws?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{4d}}\": {{",
  "      \"Question\": \"Is the arrangement maintained outside the United States primarily for the benefit of nonresident aliens?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{4e}}\": {{",
  "      \"Question\": \"Is the arrangement a payroll practice, such as direct payments of wages, overtime, vacation pay, or sick leave from the employer’s general assets?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }}",
  "  }}",
  "}}",
  "{sp_text}"
],
"rule5": [
  "Review the memorandum and determine if the arrangement described qualifies for the voluntary plans safe harbor under Rule 5.",
  "Specifically, answer the following sub-questions:",
  "5a. Is the arrangement completely voluntary for employees, meaning employees choose to participate or not without any pressure from the employer?",
  "5b. Is the arrangement funded entirely by employee contributions, with no employer contributions (other than voluntary administrative assistance)?",
  "5c. Does the employer’s role consist solely of collecting employee premiums and remitting them to the insurer, without endorsing the plan?",
  "5d. Does the employer receive no compensation from the arrangement other than reasonable administrative expenses?",
  "For each sub-question, provide:",
  "- A Yes/No answer.",
  "- A brief explanation referencing text from the memorandum where possible.",
  "Examples of plans that qualify for the voluntary safe harbor:",
  "- A purely employee-paid supplemental insurance plan offered through payroll deduction, with no employer funding.",
  "- A payroll deduction plan for employee-paid accident or hospital insurance, where the employer acts only as a conduit.",
  "Examples of plans that do NOT qualify for the voluntary safe harbor:",
  "- A plan where the employer pays any part of the premium.",
  "- A plan where the employer endorses the insurance policy or provides significant administrative support beyond simple payroll deduction.",
  "Response should only have the following JSON format:",
  "{{",
  "  \"Rule\": \"Rule5\",",
  "  \"Rule Definition\": \"An arrangement qualifies for the voluntary plans safe harbor if it is completely voluntary for employees, funded solely by employee contributions, with the employer acting only as a conduit without endorsement, and receiving no compensation except reasonable administrative expenses.\",",
  "  \"Overall Eligible\": \"Yes\" or \"No\",",
  "  \"Citation\": \"Brief reference from the memorandum that supports the conclusion.\",",
  "  \"SubQuestions\": {{",
  "    \"{{5a}}\": {{",
  "      \"Question\": \"Is the arrangement completely voluntary for employees, meaning employees choose to participate or not without any pressure from the employer?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{5b}}\": {{",
  "      \"Question\": \"Is the arrangement funded entirely by employee contributions, with no employer contributions (other than voluntary administrative assistance)?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{5c}}\": {{",
  "      \"Question\": \"Does the employer’s role consist solely of collecting employee premiums and remitting them to the insurer, without endorsing the plan?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{5d}}\": {{",
  "      \"Question\": \"Does the employer receive no compensation from the arrangement other than reasonable administrative expenses?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }}",
  "  }}",
  "}}",
  "{sp_text}"
],
"rule6": [
  "Review the memorandum and determine if the arrangement described requires an ongoing administrative scheme under Rule 6.",
  "Specifically, answer the following sub-questions:",
  "6a. Does the arrangement involve ongoing administration beyond a one-time decision or a single payment?",
  "6b. Are there processes or procedures in place to determine eligibility, handle claims, make payments, or manage benefits on a continuous basis?",
  "6c. Does the arrangement require the employer or another party to regularly manage or oversee the plan?",
  "For each sub-question, provide:",
  "- A Yes/No answer.",
  "- A brief explanation referencing text from the memorandum where possible.",
  "Examples of arrangements requiring an ongoing administrative scheme:",
  "- A health insurance plan that requires eligibility checks, claim processing, and continuous management.",
  "- A pension plan that involves ongoing recordkeeping and compliance monitoring.",
  "Examples of arrangements that do NOT require an ongoing administrative scheme:",
  "- A one-time severance payment that requires no further administration.",
  "- A single discretionary bonus payment with no ongoing eligibility or administration.",
  "Response should only have the following JSON format:",
  "{{",
  "  \"Rule\": \"Rule6\",",
  "  \"Rule Definition\": \"An arrangement that requires an ongoing administrative scheme to manage eligibility, claims, payments, or benefits beyond a one-time decision or single payment.\",",
  "  \"Overall Eligible\": \"Yes\" or \"No\",",
  "  \"Citation\": \"Brief reference from the memorandum that supports the conclusion.\",",
  "  \"SubQuestions\": {{",
  "    \"{{6a}}\": {{",
  "      \"Question\": \"Does the arrangement involve ongoing administration beyond a one-time decision or a single payment?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{6b}}\": {{",
  "      \"Question\": \"Are there processes or procedures in place to determine eligibility, handle claims, make payments, or manage benefits on a continuous basis?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{6c}}\": {{",
  "      \"Question\": \"Does the arrangement require the employer or another party to regularly manage or oversee the plan?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }}",
  "  }}",
  "}}",
  "{sp_text}"
],
"rule7": [
  "Review the memorandum and determine if any additional factors or legal conflicts could exclude the arrangement from ERISA coverage under Rule 7.",
  "Specifically, answer the following sub-questions:",
  "7a. Does the arrangement appear to be an ad hoc or purely discretionary payment rather than a structured benefit plan?",
  "7b. Does the arrangement conflict with other state or federal laws that might exempt it from ERISA coverage?",
  "7c. Does the memorandum suggest that the arrangement is intended to comply with a different regulatory framework (e.g., state insurance regulation, or a government-mandated benefit)?",
  "For each sub-question, provide:",
  "- A Yes/No answer.",
  "- A brief explanation referencing text from the memorandum where possible.",
  "Examples of arrangements that may be excluded under Rule 7:",
  "- Ad hoc severance payments with no ongoing administrative scheme.",
  "- Benefits mandated by state law, such as state-mandated disability benefits.",
  "Examples of arrangements that are generally included under ERISA despite other laws:",
  "- Health insurance plans regulated by state insurance laws but sponsored by private employers.",
  "- Retirement plans that comply with both ERISA and the Internal Revenue Code.",
  "Response should only have the following JSON format:",
  "{{",
  "  \"Rule\": \"Rule7\",",
  "  \"Rule Definition\": \"An arrangement that may be excluded from ERISA coverage due to additional factors, such as being ad hoc, conflicting with other laws, or falling under a different regulatory framework.\",",
  "  \"Overall Eligible\": \"Yes\" or \"No\",",
  "  \"Citation\": \"Brief reference from the memorandum that supports the conclusion.\",",
  "  \"SubQuestions\": {{",
  "    \"{{7a}}\": {{",
  "      \"Question\": \"Does the arrangement appear to be an ad hoc or purely discretionary payment rather than a structured benefit plan?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{7b}}\": {{",
  "      \"Question\": \"Does the arrangement conflict with other state or federal laws that might exempt it from ERISA coverage?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }},",
  "    \"{{7c}}\": {{",
  "      \"Question\": \"Does the memorandum suggest that the arrangement is intended to comply with a different regulatory framework (e.g., state insurance regulation, or a government-mandated benefit)?\",",
  "      \"Answer\": \"Yes\" or \"No\",",
  "      \"Explanation\": \"Brief explanation referencing text from the memorandum.\"",
  "    }}",
  "  }}",
  "}}",
  "{sp_text}"
]

}